In [13]:
from pandas import Series,DataFrame
import pandas as pd
data = Series([1,2,3,4],index = ['a','b','c','d'])
print(data)
type(data)

a    1
b    2
c    3
d    4
dtype: int64

pandas.core.series.Series

In [17]:
data = {'a':[1,2,3],'b':['we','you','they'],'c':['btc','eos','ae']}
df = DataFrame(data)
print(df)
type(df)

   a     b    c
0  1    we  btc
1  2   you  eos
2  3  they   ae

pandas.core.frame.DataFrame

In [19]:
# 创建series方式1
data = Series([222,'btc',234,'eos'])
print(data)

0    222
1    btc
2    234
3    eos
dtype: object

In [21]:
# 创建方式二2
data = Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(data)
dic = {'a':1,'b':2,'c':'as'}
dicSeries = Series(dic)
print(dicSeries)

a    1
b    2
c    3
d    4
e    5
dtype: int64
a     1
b     2
c    as
dtype: object

In [22]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [23]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [24]:
# series的NaN生成
index1 = [ 'a','b','c','d']
dic = {'b':1,'c':1,'d':1}
data2 = Series(dic,index=index1)
data2

a    NaN
b    1.0
c    1.0
d    1.0
dtype: float64

In [26]:
# NaN的相关查询：
data2.isnull()

a     True
b    False
c    False
d    False
dtype: bool

In [27]:
data2.notnull()

a    False
b     True
c     True
d     True
dtype: bool

In [34]:
#嵌套查询NaN
data2[data2.isnull()==True]

a   NaN
dtype: float64

In [35]:
data2.count()    #统计非NaN个数

3

In [40]:
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [41]:
data2

a    NaN
b    1.0
c    1.0
d    1.0
dtype: float64

In [42]:
data+data2

a    NaN
b    3.0
c    4.0
d    5.0
e    NaN
dtype: float64

In [45]:
data.index.name = 'abc'
data.name = 'test'
data

abc
a    1
b    2
c    3
d    4
e    5
Name: test, dtype: int64

In [83]:
# DataFrame生成
data = {'name': ['BTC', 'ETH', 'EOS'], 'price':[50000, 4000, 150]}
data = DataFrame(data)
data

  name  price
0  BTC  50000
1  ETH   4000
2  EOS    150

In [48]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [50]:
data.values

array([['BTC', 50000],
       ['ETH', 4000],
       ['EOS', 150]], dtype=object)

In [51]:
data.columns

Index(['name', 'price'], dtype='object')

In [52]:
data.name

0    BTC
1    ETH
2    EOS
Name: name, dtype: object

In [53]:
data['name']

0    BTC
1    ETH
2    EOS
Name: name, dtype: object

In [57]:
'''
其实行索引，除了iloc，loc还有个ix，ix既可以进行行标签索引，
也可以进行行号索引，但这也大大增加了它的不确定性，
有时会出现一些奇怪的问题，所以pandas在0.20.0版本的时候就把ix给弃用了
'''
data.iloc[1]

name      ETH
price    4000
Name: 1, dtype: object

In [76]:
# DataFrame常用操作

#简单地增加行、列：
data['type'] = 'token'    #增加列
data

  name  price   type
0  BTC  50000  token
1  ETH   4000  token
3   ae    200  token

In [77]:
data.loc['3'] = ['ae',200,'token']    #增加行
data

  name  price   type
0  BTC  50000  token
1  ETH   4000  token
3   ae    200  token

In [65]:
# 删除行、列操作：
del data['type']    #删除列
data

  name  price
0  BTC  50000
1  ETH   4000
2  EOS    150
3   ae    200

In [85]:
data.drop([2])    #删除行
# 需要注意的是，使用drop（）方法返回的是Copy而不是视图，要想真正在原数据里删除行，就要设置inplace=True

  name  price
0  BTC  50000
1  ETH   4000

In [87]:
data.drop([1],inplace=True)

In [89]:
data

  name  price
0  BTC  50000
2  EOS    150

In [90]:
# 设置某一列为index:
data.set_index(['name'],inplace=True)
data

      price
name
BTC   50000
EOS     150

In [91]:
data.reset_index(inplace=True)    #将index返回回dataframe中
data

  name  price
0  BTC  50000
1  EOS    150

In [105]:

data.loc['4'] = ['ae',2323]    #增加行
data

  name  price
0  BTC  50000
1  EOS    150
2   ae    200
3   ae    200
4   ae   2323

In [106]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [109]:
# 计算在store_items中NaN值的个数
x =  store_items.isnull().sum().sum()
print('在我们DataFrame中NaN的数量:', x)

在我们DataFrame中NaN的数量: 3

In [111]:
store_items.isnull()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [113]:
print('在我们DataFrame的列中具有非NaN值得数量分别为:\n', store_items.count())

在我们DataFrame的列中具有非NaN值得数量分别为:
 bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [115]:
# 如果 axis = 0，.dropna(axis) 方法将删除包含 NaN 值的任何行
# 如果 axis = 1，.dropna(axis) 方法将删除包含 NaN 值的任何列
# 删除包含NaN值得任何行
store_items.dropna(axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [117]:
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [119]:
# 将NaN值替换为合适的值
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [121]:
# 我们还可以使用 .fillna() 方法将 NaN 值替换为 DataFrame 中的上个值，称之为前向填充

# .fillna(method = 'ffill', axis) 将通过前向填充 (ffill) 方法沿着给定 axis 使用上个已知值替换 NaN 值
store_items.fillna(method = 'ffill', axis = 0)
# 注意 store 3 中的两个 NaN 值被替换成了它们所在列中的上个值。
# 但是注意， store 1 中的 NaN 值没有被替换掉。因为这列前面没有值，因为 NaN 值是该列的第一个值。

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [123]:
store_items.fillna(method = 'ffill', axis = 1)
#在这种情况下：所有 NaN 值都被替换成了之前的行值

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [125]:
#同时，也可以选择用 DataFrame 中之后的值替换 NaN 值，称之为后向填充
# 向后填充列，即为NaN的列值，用其列中的后一个来填充
store_items.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [127]:
# 向后填充行，即为NaN的行值，用其行中的后一个来填充
store_items.fillna(method = 'backfill', axis = 1)
#注意：.fillna() 方法不在原地地替换（填充）NaN 值。也就是说，原始 DataFrame 不会改变。
#你始终可以在 fillna() 函数中将关键字 inplace 设为 True，在原地替换 NaN 值。

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [129]:
#还可以选择使用不同的插值方法替换 NaN 值
#interpolate(method = 'linear', axis) 方法将通过 linear 插值使用沿着给定 axis 的值替换 NaN 值, 这个差值也就是前后或者上下的中间值
store_items.interpolate(method = 'linear', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [131]:
#也可用行值插入
store_items.interpolate(method = 'linear', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

In [149]:
#数据合并
#data = {'name': ['BTC', 'ETH', 'EOS','EEE'], 'price':[50000, 4000, 150,555]}
data = [{'name':'BTC','price':5000},{'name':'ETH','price':1000},{'name':'EOS','price':400},{'name':'EEE',}
]
data = DataFrame(data,index=[0,1,2,3])
data

  name   price
0  BTC  5000.0
1  ETH  1000.0
2  EOS   400.0
3  EEE     NaN

In [150]:
#data2 = {'name': ['BTC', 'ETH', 'EOS','EEE'], 'other':[50000, 4000, 150,555]}
data2 = [{'name':'BTC','other':5000},
{'name':'ETH','other':1000},
{'name':'EOS','other':400},
{'other':30}
]
data2 = DataFrame(data2,index=[0,1,2,3])
data2

  name  other
0  BTC   5000
1  ETH   1000
2  EOS    400
3  NaN     30

In [153]:
pd.merge(data,data2,on='name',how='left')    #以name为key进行左连接
#平时进行数据合并操作，更多的会出一种情况，那就是出现重复值，DataFrame也为我们提供了简便的方法：
#data.drop_duplicates(inplace=True)

  name   price   other
0  BTC  5000.0  5000.0
1  ETH  1000.0  1000.0
2  EOS   400.0   400.0
3  EEE     NaN     NaN

In [156]:
# 数据的简单保存与读取：
data.to_csv('D:\\test.csv')
pd.read_csv('D:\\test.csv')

   Unnamed: 0 name   price
0           0  BTC  5000.0
1           1  ETH  1000.0
2           2  EOS   400.0
3           3  EEE     NaN

In [157]:
# 数据的简单保存与读取：
data.to_csv('D:\\test.csv',index=None)    #不保存行索引
pd.read_csv('D:\\test.csv')

  name   price
0  BTC  5000.0
1  ETH  1000.0
2  EOS   400.0
3  EEE     NaN